{"data":{"markdownRemark":{"id":"94c0214d-cc5d-5ab8-aacf-50bb17d031c6","html":"<h2>Project title</h2>\n<h3>Introduction</h3>\n<p>Before offering the solution, you should first define the problem. Describe the current state of the issue and write a few words on how you plan on implementing your solution. Link to existing discussions if possible.</p>\n<h3>Project goals</h3>\n<p>List the deliverables for your project, explaining what exactly you are going to do.</p>\n<h3>Implementation</h3>\n<p>Provide more detail on how you will achieve the goals described in the previous section. Minute technical details are not necessary. Describe the tools and technologies you intend to use, and motivate your choices.</p>\n<h3>Timeline</h3>\n<p>This is a good place to demonstrate your understanding the problem and that you have made a manageable project. Your timeline will be evaluated based on manageability and realism, so aim for a clear timeline that leaves room for additions rather than promising things you might not be able to deliver.</p>\n<p>Please also list any other commitments you have during GSoC (job, internship, etc).</p>\n<h3>About me</h3>\n<p>Write a few sentences about yourself, your experience and what makes you a good candidate. If you have participated in open source projects before, this would be a good place to list those projects. Optionally also include contact information for relevant references.</p>\n<h3>Contact details</h3>\n<p>Please specify your contact details, location, time zone and language familiarity. Optionally you can also provide links to your profiles on GitHub, LinkedIn, personal webpage, etc.</p>","excerpt":"Project title Introduction Before offering the solution, you should first define the problem. Describe the current state of the issue and write a few words on how you plan on implementing your solution. Link to existing discussions if possible. Project goals List the deliverables for your project…","frontmatter":{"title":"Proposal template"}},"allMarkdownRemark":{"edges":[{"node":{"id":"86f28d2b-5e25-5edb-a877-c6a0ed66465b","fields":{"slug":"/gsoc/"},"frontmatter":{"title":"GSoC"}}},{"node":{"id":"94c0214d-cc5d-5ab8-aacf-50bb17d031c6","fields":{"slug":"/gsoc-template/"},"frontmatter":{"title":"Proposal template"}}}]}},"pageContext":{"id":"94c0214d-cc5d-5ab8-aacf-50bb17d031c6"}}