{"data":{"markdownRemark":{"id":"8493f667-6117-50a0-bc92-21f304190a9f","html":"<p>This document contains notes about implementing a CRDT on top of the Ledger on Fuchsia, based on existing and planned work for Xi's text CRDT. It should be helpful for anyone developing a CRDT that works in the form of a Ledger custom conflict resolver that merges two histories.</p>\n<h2 id=\"basic-setup\"><a href=\"#basic-setup\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Basic Setup</h2>\n<p>When you open a document that is synced with the ledger you want to do a few things:</p>\n<ol>\n<li>Set a conflict resolver factory that uses your CRDT merge if you haven't already done so.</li>\n<li>Find the Ledger page ID that corresponds with the document, you could do this by hashing the document ID, storing references to IDs in the root page, or storing a randomly generated page ID in the story Link.</li>\n<li>Get that page and call <code>GetSnapshot</code> to get a snapshot, also register a <code>PageWatcher</code> in the same call.</li>\n<li>Load the initial state of your document from the page snapshot into your local in-memory state.</li>\n<li>Start listening on the <code>PageWatcher</code> for updates. It's important to start listening after you load or you might encounter race conditions.</li>\n<li>Whenever your <code>PageWatcher</code> recieves an update you want to use your CRDT <code>merge</code> to merge the updated state into your local state. You don't want to just load it because you may have pending edits in your local state that haven't made it into the ledger yet, see the next section. Make sure you respond to the FIDL message only after you are done incorporating the changes.</li>\n</ol>\n<h2 id=\"handling-edits\"><a href=\"#handling-edits\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Handling Edits</h2>\n<p>When an edit is made by the user that arrives through some event, you want to store that change in the Ledger as soon as possible so that other users get it, but doing so with minimal latency without violating CRDT properties is non-trivial.</p>\n<p>Below is the procedure we've came up with:</p>\n<ol>\n<li>Apply the edit to your local state. Feel free to update the view right away.</li>\n<li>Call <code>StartTransaction</code> on the <code>Page</code> and wait for the result.</li>\n<li>The <code>StartTransaction</code> call will only return once all pending <code>PageWatcher</code> updates have returned. So in the mean time all pending updates to the state will be processed, then the visible state of the <code>Page</code> will be frozen so that your local state reflects the current visible <code>Page</code> state.</li>\n<li>\n<p>Once the <code>StartTransaction</code> call returns, do one of two things depending on how you represent your CRDT in Ledger:</p>\n<ul>\n<li>If your state as stored as a single key or structure that gets updated as a whole, <code>Put</code> your local state into the Ledger.</li>\n<li>If your state is stored as a multi-key history which must only be appended to, load the current state of the <code>Page</code> and <code>merge</code> your local state into the loaded state, then <code>Put</code> the new appended edits to the Ledger. If you just put your local history, it might have a different ordering even if it semantically contains the same edits, violating the append-only constraint. The append-only nature also prevents thrashing where two peers alternative overwriting the whole history with their own ordering, which would bloat the Ledger history and eliminate the ability to get minimal diffs through changed keys.</li>\n</ul>\n</li>\n<li>Call <code>Commit</code> on the <code>Page</code></li>\n</ol>\n<p>There's alternative ways you can do this, but they tend to require waiting for round-trips to the Ledger in order for edits to reach the screen. They also tend to rely more heavily on the conflict resolver, which is probably more expensive than just using your <code>merge</code> operation in-process.</p>\n<h2 id=\"representation\"><a href=\"#representation\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Representation</h2>\n<p>It's normally easiest to start by storing your entire CRDT serialized into one Ledger key, but this doesn't scale to large instances.</p>\n<p>Here's some ideas for representations we've come up with:</p>\n<h4 id=\"lists\"><a href=\"#lists\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Lists</h4>\n<p>For large lists where you want to be able to insert and delete ranges anywhere in the list incrementally, for example the list of characters in the current text of a document, there's a couple options:</p>\n<p>You can use a linked list of chunks with a maximum and minimum length. Each chunk uses a key which is just some 64 bit number, and a value which is the chunk content. When you insert you modify the corresponding chunk and if it grows bigger than the maximum length you split it into multiple chunks, modifying the sibling pointers of adjacent chunks. If you delete and a chunk gets too small you merge it with adjacent chunk(s). This allows the size of the Ledger commit to be proportional to the size of the change, as well as allowing you to use the changed keys in page watchers and conflicts to get a conservative diff that allows you to avoid loading the whole document. If just the linear search to find the correct chunk to insert in is too slow, you can make it a skip list or a balanced tree.</p>\n<p>Alternatively, instead of making it a linked list you can use the keys to determine the ordering. When you insert a chunk between two other chunks you use a longer key that sorts between the keys of the two chunks you are between. Deleting a chunk just requires deleting that pair. This is similar to the previous method except it requires modifying less keys per edit, but has unbounded key growth.</p>\n<h4 id=\"histories\"><a href=\"#histories\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Histories</h4>\n<p>For append-only histories, it's easy to store each revision as a separate pair with an incrementing counter for the key. The key ordering determines the order of history. Change size is just the size of the revision, and the changed keys tells you where the new edits are.</p>\n<p>For longer histories, especially ones that are compressible, we want to batch edits together into chunks so that we waste less space on keys and also can compress edits within a chunk.</p>\n<p>We can do this by just chunking every N (say 100) revisions together, with the last chunk potentially having less than N. Then appending just modifies the last chunk or adds a new chunk. Ledger's rolling hash for values will compress shared prefixes so that appending to a chunk doesn't bloat storage. However, it still makes finding new edits via differing keys less fine-grained and requires serializing and sending the entire chunk.</p>\n<p>Alternatively, whenever a new edit is appended it can be added as its own key-value pair. Every once in a while a rollup process takes the last N individual edits and batches them into a chunk. This gives smaller transfers and more minimal key diffs, but is potentially more complicated.</p>\n<h2 id=\"other-notes\"><a href=\"#other-notes\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Other Notes</h2>\n<ul>\n<li>If your CRDT is based on appending to a history, make sure that the left side of the merge is the one appended to in your conflict resolver, since results are submitted as differences from the left side.</li>\n<li>Ensure the Ledger representation of the result of a CRDT merge is deterministic, otherwise convergence will take much longer under concurrent editing. The easiest way to run afoul of this is using randomly-generated IDs.</li>\n<li>The result of a conflict you are asked to resolve is not guaranteed to become the current state yet, don't set it as your local state, wait for the <code>PageWatcher</code> update from Ledger.</li>\n<li>Commits can fail when out of disk space or memory. You should listen to the result of the <code>Commit</code> call to display some error state to user so they stop typing anything they care about. You also need to listen to wait for last commit before shutting down, or it may or may not be completed.</li>\n</ul>","frontmatter":{"title":"CRDT - Using the Ledger for CRDTs"}},"site":{"siteMetadata":{"title":"Gatsby Blog Tailwindcss","titleSeparator":"|"}}},"pageContext":{"id":"8493f667-6117-50a0-bc92-21f304190a9f"}}