{"data":{"markdownRemark":{"id":"0c5f285f-2a9b-589f-8eff-a79435e54257","html":"<p>(originally written 7 May 2016, now at <a href=\"crdt.md\">crdt.md</a>)</p>\n<p>I'll publish this shortly as a doc in the xi repo, but figured it might be useful to get a draft up here first. I'm prototyping the relevant diff calculations hinted in the second section, not sure how useful it would be to describe the data structures and algorithms in detail. Feels like working code is the most important thing :)</p>\n<h1 id=\"a-crdt-approach-to-async-plugins-and-undo\"><a href=\"#a-crdt-approach-to-async-plugins-and-undo\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>A CRDT approach to async plugins and undo</h1>\n<p>A primary goal of the xi project is to provide extremely fast responsiveness in all circumstances. For core editing operations, this can generally be accomplished by extremely fast implementation of the editing primitives. However, non-responsiveness due to plugins is a very significant problem, and just making faster plugins is not an appealing solution; we want plugins to do sophisticated lexical and syntactical analysis so their operations can be accurate.</p>\n<p>Other editor projects recognize delays due to plugins and propose to run the plugins asynchronously. <a href=\"https://github.com/neovim/neovim/wiki/Plugin-UI-architecture\">Neovim</a> is probably the most advanced in this regard. However, simply running the editing operations asynchronously carries its own risk: the user and the plugin (or perhaps multiple plugins) are <em>racing,</em> and the final editing result can depend on the order of execution.</p>\n<p>This problem is fundamentally similar to collaborative editing, and there is a literature spanning decades. Some of the approaches, such as <a href=\"https://en.wikipedia.org/wiki/Operational_transformation\">operational transformation</a>, are fiendishly difficult to implement correctly, and seem like overkill for a primarily single-user text editor. However, in recent years, the Conflict-free Replicated Data Type (CRDT) approach has emerged, and I believe it is well suited for xi. In particular, I believe a centralized CRDT implementation in the core can be implemented with only a bit more complexity than required for undo and running plugins asynchronously, and yet provide strong eventual consistency guarantees characteristic of CRDTs.</p>\n<p>In addition, should xi ever be extended to collaborative editing, having the model be based on the CRDT abstraction will make implementation much easier, leaving only the small matter of efficient distributed CRDTs themselves.</p>\n<p>This document is structured into two main sections. The first presents the model at a conceptual level, and effectively functions as a spec for how out-of-order edits should be merged, as well as the desired semantics for undo. The second details a simple and efficient centralized implementation, which faithfully implements the model but bypasses the complexity of a true distributed environment.</p>\n<h2 id=\"crdt-model\"><a href=\"#crdt-model\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>CRDT model</h2>\n<p>The document consists of a collection of characters, each of which has a stable unique id. In addition, there are <em>ordering edges</em> between pairs of characters. For example, if the document is \"AB\" and the user inserts an \"X\" between these two characters, the ordering edges A &#x3C; X and X &#x3C; B are generated. Two special id's represent the beginning and end of the document.</p>\n<p>If only a single user were editing the document, then these edges would form a total order. However, in the face of concurrent edits, they are in general only a partial order. For example, if another user inserts \"Y\" at the same location, then the additional edges A &#x3C; Y and Y &#x3C; B are generated, but there is no order between X and Y. In this case, we define tie-breaking rules based on an integer id of each user. For example, assume the first user has the lower id. Then, with the edits applied in either order, the result will consistently be \"AXYB\". This approach follows WOOT.</p>\n<h3 id=\"deletion-tombstones-intervals\"><a href=\"#deletion-tombstones-intervals\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Deletion; tombstones; intervals</h3>\n<p>In a CRDT framework, the user action of deleting a character doesn't remove it from the graph, it simply marks it as deleted. Thus, the merge operation forms a monotonic semi-lattice; the union of new characters and ordering edges, and the \"or\" of delete state for the character.</p>\n<p>A deleted character is known as a \"tombstone\", and these have also been used to patch up operational transformations to fix the failure to achieve eventual consistency (this is known in the literature as the TP2 puzzle and is well explained in the tombstone paper referenced below). Retaining tombstones doubly makes sense in an editor because there is a chance the deletion will be undone, so retaining it guarantees that its order relative to its context is preserved.</p>\n<p>In xi, rather than retaining a deleted state for each individual character, we will represent deletions as <em>intervals.</em> This still fits well into the CRDT model; the delete state is a set of intervals, and the merge operation is simple set union (obviously also a monotonic semilattice).</p>\n<p>An interval is defined as a start point and an end point. Each point is either <em>before</em> or <em>after</em> a given character. In the example above, if the document is \"AB\", then \"after A\" and \"before B\" initially refer to the same cursor location, but would become different after insertion between the two.</p>\n<p>A consequence of the interval approach is that some inserts can get lost. For example, if the document is \"AB\", user 1 deletes \"AB\", and user 2 concurrently inserts \"X\" between A and B, then the resulting document is empty. In the CRDT view, the characters are A, B, and X, the ordering edges are A &#x3C; B, A &#x3C; X, and X &#x3C; B, and the deleted interval set is {(before A, after B)}. This is a different state than would be the case in WOOT, which would mark A and B as deleted but retain X, but I think quite reasonable semantically.</p>\n<p>Also note that the interval approach is strictly more general; if the per-character granularity of deletion is desired, it can be simulated by creating a (before C, after C) interval for each character to be deleted.</p>\n<h3 id=\"undo\"><a href=\"#undo\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Undo</h3>\n<p>Defining the semantics of undo is tricky, especially in the face of concurrent edits, and a lot of ink has been spilled on the subject. Here we present a simple but general model again based on CRDT.</p>\n<p>Each editing operation is assigned an \"undo group.\" Several edits may be in the same group. For example, if the user types <code>\"</code>, then a smart-quote plugin may revise that to '“'. If the smart-quote revision is assigned the same undo group (because it is a consequence of the same user action), then a single undo would zorch both edits. Note, incidentally, that TextEdit on macOS does not exhibit this behavior. The first undo leaves the buffer with '\"' (and selected), and it requires a second undo to return to the intial contents.</p>\n<p>Each edit has <em>two</em> sets intervals, one for deletions (as above), but also for insertions. The set of characters covered by the insertion intervals should be exactly the set of new characters introduced by the edit. In normal editing, the insertion intervals are ignored. However, when an undo group goes into an undone state, the insertion and deletion intervals are swapped. Note that if a character is both inserted and deleted by edits in the same undo group (as is the case for the poor dumb quote above), its state does not change.</p>\n<p>Note that the mechanism allows for selective undo of any undo group. We probably won't expose this generality through the UI, but rather provide the familiar ctrl-z, shift-ctrl-z keybindings. However, undoing complex edits interleaved with others (because of slow plugins) will call upon this generality.</p>\n<p>I'm not overly concerned with concurrent modification to undo state, as it will be managed by the central core, but it's still straightforward to handle as a CRDT. Each undo group gets a distributed counter, and the group is considered to be undone when the counter is odd-valued.</p>\n<h3 id=\"recap\"><a href=\"#recap\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Recap</h3>\n<p>It's worth recapping the end-to-end flow, because it's not obvious. Reconstructing the visible buffer contents from the CRDT state will be described as a batch operation. Obviously we want to compute that incrementally, but implementation details add complexity and are very different depending on whether it is centralized or distributed.</p>\n<p>The CRDT state is:</p>\n<ul>\n<li>\n<p>A set of characters, each given by stable unique id (and for which two id's can be compared for tie-breaking purposes).</p>\n</li>\n<li>\n<p>A set of ordering edges, each of which is a pair of ids.</p>\n</li>\n<li>\n<p>A set of edits, each of which consists of:</p>\n</li>\n<li>\n<p>An undo group id.</p>\n</li>\n<li>\n<p>A set of delete intervals.</p>\n</li>\n<li>\n<p>A set of insert intervals.</p>\n</li>\n</ul>\n<p>These are all basically sets, so the CRDT merge operation is just set union of each of these components.</p>\n<p>To reconstruct the buffer:</p>\n<ul>\n<li>\n<p>Topologically sort the characters by ordering edges and tiebreaks, yielding a sequence.</p>\n</li>\n<li>\n<p>Decide for each edit group whether it is in an undo state, either centrally or by taking the parity of its associated counter.</p>\n</li>\n<li>\n<p>For each edit, if its edit group is in an undone state, add its insert intervals, otherwise add its delete intervals.</p>\n</li>\n<li>\n<p>Take the union of all intervals from the previous step, and delete those from the sequence.</p>\n</li>\n</ul>\n<p>Et voila!</p>\n<h2 id=\"efficient-implementation\"><a href=\"#efficient-implementation\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Efficient implementation</h2>\n<p>Details to come later, but I'll try to sketch out rough ideas.</p>\n<p>In xi, we're not setting out to do a fully distributed peer-to-peer CRDT implementation (though such a thing would be a very interesting future extension). Rather, we want to exploit the assumption that the core is fast and reliable, and have it evaluate the CRDT efficiently and incrementally, but in serial.</p>\n<p>Instead of storing the CRDT components explicitly, we store a sequence of <em>snapshots.</em> Following the CRDT model, each snapshot contains the \"union string\" (the result of the topological sort, with deleted sections still present). However, we don't store explicit unique ids for each character, or explicit ordering edges. Rather, the total order (with tie-breaking applied) is preserved in each snapshot.</p>\n<p>Because we don't have explicit unique id's, we simulate them by doing <em>coordinate transforms.</em> This is fairly straightforward because the only difference between the union strings in two different snapshots is intervals of inserted characters. In fact, we can probably re-use the \"insert intervals\" retained for undo purposes as the concrete representation of the needed coordinate transforms.</p>\n<p>The coordinate transform approach has an operational transform flavor, but it is important to note, the goal is still to implement exactly the same CRDT computation as specified in the first section.</p>\n<p>We don't retain all snapshots going back to the beginning of history, nor do we retain all tombstones indefinitely. Rather, we <em>garbage collect</em> a snapshot as soon as it is no longer needed (because it expired out of the undo buffer and we are sure its undo state will not toggle, and because it is not used as the base of any in-flight plugin operation). Garbage collection also removes deleted intervals when there is no possible future reference to them.</p>\n<p>In the general case, undo requires going back to an earlier snapshot (the latest one that doesn't contain any edits from the undo group being toggled), and replaying the history from there. Because of this and the need for garbage collection, the undo history will be bounded rather than infinite (20 steps seems reasonable).</p>\n<h2 id=\"references\"><a href=\"#references\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>References</h2>\n<p><a href=\"https://hal.archives-ouvertes.fr/inria-00432373/document\">An Undo Framework for P2P Collaborative Editing</a></p>\n<p><a href=\"http://www.loria.fr/~urso/uploads/Main/oster06collcom.pdf\">Tombstone Transformation Functions for Ensuring Consistency in Collaborative Editing Systems</a></p>\n<p><a href=\"https://hal.inria.fr/inria-00071240/document\">Real time group editors without Operational transformation</a> (WOOT)</p>\n<p><a href=\"http://hal.upmc.fr/inria-00555588/document\">A comprehensive study of Convergent and Commutative Replicated Data Types</a></p>\n<h3 id=\"in-comments\"><a href=\"#in-comments\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>In comments</h3>\n<p>Christophe Poucet wondered whether the CRDT requirements (allowing fully peer-to-peer topology, undo) were too hard, and whether relying on a central server might make things a lot easier, summarizing the question as \"So do you really need full commutativity, or can you simplify your life by requiring a less constricting algebra?\". I answered:</p>\n<p>Very good question, I have been very much wondering the same thing. I believe the answer is no, but only because of an implicit assumption in your question, that doing full-on CRDT's is hard. That's a common belief, but now that I'm pretty far into the implementation I can't think of any easier or simpler way to build something that meets all my other requirements, even if I were to significantly relax the consistency constraints.</p>\n<p>The fact that doing text CRDT on a central server is simple and efficient may be a new, publishable result. That's one of my goals in posting here, to get feedback from Google's (hopefully) legions of CRDT experts. Have I made a significant advance in the practice of CRDT, or am I just noodling around with something trivial that has no relevance beyond overengineering an async plugin protocol for text editors?</p>\n<p>Even if it is the latter, it's still fun and meets the goals I set out with :)</p>\n<hr>\n<p>After thinking about it a bit more, I think I can give your question a more precise answer.</p>\n<p>Yes, in a two-player game where the only moves are insert and delete, simple operational transforms work, and you can't trigger the TP2 puzzle. However, undo changes that. Let's say the buffer is \"abc\". The user inserts \"2\" after \"b\" and then deletes \"b2\". Concurrently, the plugin inserts \"1\" after \"a\". Buffer is now \"a1c\". User undoes the delete of \"b2\", and I believe the standard transformations yield \"ab21c\". If user then deletes the \"b\", the result is the classic TP2 puzzle, but this last step is not necessary to show there's a problem.</p>\n<p>So, I think there are some conclusions. First, undo genuinely increases the potential for conflict due to concurrent edits. I had a gut feeling this was the case, but it's nice to have a concrete example. Second, I think this is an instance of the pattern where it's easier to solve the more general problem than deal with special cases.</p>","frontmatter":{"title":"Rope science, part 9 - CRDT Approach to Async Plugins and Undo"}},"site":{"siteMetadata":{"title":"Gatsby Blog Tailwindcss","titleSeparator":"|"}}},"pageContext":{"id":"0c5f285f-2a9b-589f-8eff-a79435e54257"}}